rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>MM32F013x</name>
	<version>1.01</version>
	<description>MM32F013x</description>
	<!--Bus Interface Properties-->
	<!--Cortex-M0 is byte addressable-->
	<cpu><name>CM0</name><revision>r0p0</revision><endian>little</endian><mpuPresent>false</mpuPresent><fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits><vendorSystickConfig>false</vendorSystickConfig></cpu><addressUnitBits>8</addressUnitBits>
	<!--the maximum data bit width accessible within a single transfer-->
	<width>32</width>
	<!--Register Default Properties-->
	<size>0x20</size>
	<resetValue>0x0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<peripherals>
		<peripheral>
			<name>ADC1</name>
			<description>Analog to digital converter 1</description>
			<groupName>ADC</groupName>
			<baseAddress>0x40012400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC1_COMP</name>
				<description>ADC1 and compare global interrupt</description>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>ADC current channel convert data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configure register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADCPREL</name>
							<description>ADC low prescaler coefficient</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAMCTL</name>
							<description>Channel x Sample time selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RSLTCTL</name>
							<description>Resolution</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ADCPREH</name>
							<description>ADC high prescaler coefficient</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>VSEN</name>
							<description>Reference voltage enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEN</name>
							<description>Temperature sensor enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWEN</name>
							<description>ADC window comparison enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADEN</name>
							<description>ADC enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRG_EDGE</name>
							<description>Trigger edge selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>TRGSHIFT</name>
							<description>External trigger shift sample</description>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>TRGSELH</name>
							<description>External trigger selection high</description>
							<bitOffset>17</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SCANDIR</name>
							<description>ADC scan direction</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMPCH</name>
							<description>Window comparison channel selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ALIGN</name>
							<description>Data alignment</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADMD</name>
							<description>ADC mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADST</name>
							<description>ADC start</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRGSELL</name>
							<description>External trigger selection low</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>Direct memory access enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRGEN</name>
							<description>External trigger enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWIE</name>
							<description>ADC window comparator interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADIE</name>
							<description>ADC interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSR</name>
					<displayName>CHSR</displayName>
					<description>Channel select register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHENVS</name>
							<description>Internal reference voltage channel enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHENTS</name>
							<description>Temperature Sensor channel enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN9</name>
							<description>Analog input channel 9 enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN8</name>
							<description>Analog input channel 8 enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN7</name>
							<description>Analog input channel 7 enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN6</name>
							<description>Analog input channel 6 enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN5</name>
							<description>Analog input channel 5 enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN4</name>
							<description>Analog input channel 4 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN3</name>
							<description>Analog input channel 3 enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN2</name>
							<description>Analog input channel 2 enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN1</name>
							<description>Analog input channel 1 enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN0</name>
							<description>Analog input channel 0 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPR</name>
					<displayName>CMPR</displayName>
					<description>Compare register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMPHDATA</name>
							<description>Compare data high limit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>CMPLDATA</name>
							<description>Compare data low limit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>Current conversion channel</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSY</name>
							<description>Busy</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWIF</name>
							<description>ADC window comparator interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADIF</name>
							<description>ADC interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR0</name>
					<displayName>DR0</displayName>
					<description>Channel 0 data register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR1</name>
					<displayName>DR1</displayName>
					<description>Channel 1 data register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR2</name>
					<displayName>DR2</displayName>
					<description>Channel 2 data register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR3</name>
					<displayName>DR3</displayName>
					<description>Channel 3 data register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR4</name>
					<displayName>DR4</displayName>
					<description>Channel 4 data register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR5</name>
					<displayName>DR5</displayName>
					<description>Channel 5 data register</description>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR6</name>
					<displayName>DR6</displayName>
					<description>Channel 6 data register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR7</name>
					<displayName>DR7</displayName>
					<description>Channel 7 data register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR8</name>
					<displayName>DR8</displayName>
					<description>Channel 8 data register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR9</name>
					<displayName>DR9</displayName>
					<description>Channel 9 data register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR14</name>
					<displayName>DR14</displayName>
					<description>Channel 14 data register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR15</name>
					<displayName>DR15</displayName>
					<description>Channel 15 data register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STA_EXT</name>
					<displayName>STA_EXT</displayName>
					<description>Extended status register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
