rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>CHANY0</name>
					<displayName>CHANY0</displayName>
					<description>Arbitrary channel channel selection register 0</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHANY_SEL7</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL6</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL5</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL4</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL3</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL2</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL1</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL0</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHANY1</name>
					<displayName>CHANY1</displayName>
					<description>Arbitrary channel channel selection register 1</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHANY_SEL15</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL14</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL9</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHANY_SEL8</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ANY_CFG</name>
					<displayName>ANY_CFG</displayName>
					<description>Arbitrary channel configuration register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>CHANY_NUM</name>
							<description>channel number configuration</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ANY_CR</name>
					<displayName>ANY_CR</displayName>
					<description>Arbitrary channel control register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>CHANY_MDEN</name>
							<description>Any channel configuration mode enable bit</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>BKP</name>
			<description>Backup registers</description>
			<groupName>BKP</groupName>
			<baseAddress>0x40002840</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x02E0</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>RTCCR</name>
					<displayName>RTCCR</displayName>
					<description>RTC clock calibration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ASOS</name>
							<description>Alarm or second output selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ASOE</name>
							<description>Alarm or second output enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCO</name>
							<description>Calibration clock output</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAL</name>
							<description>Calibration value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Backup control register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TPAL</name>
							<description>TAMPER pin active level</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TPE</name>
							<description>TAMPER pin enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>BKP control/status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TIF</name>
							<description>Tamper interrupt flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEF</name>
							<description>Tamper event flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TPIE</name>
							<description>TAMPER pin interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTI</name>
							<description>Clear tamper interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTE</name>
							<description>Clear tamper event</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR1</name>
					<displayName>DR1</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR2</name>
					<displayName>DR2</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR3</name>
					<displayName>DR3</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR4</name>
					<displayName>DR4</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR5</name>
					<displayName>DR5</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR6</name>
					<displayName>DR6</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR7</name>
					<displayName>DR7</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR8</name>
					<displayName>DR8</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR9</name>
					<displayName>DR9</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR10</name>
					<displayName>DR10</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR11</name>
					<displayName>DR11</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR12</name>
					<displayName>DR12</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR13</name>
					<displayName>DR13</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR14</name>
					<displayName>DR14</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR15</name>
					<displayName>DR15</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR16</name>
					<displayName>DR16</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR17</name>
					<displayName>DR17</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR18</name>
					<displayName>DR18</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR19</name>
					<displayName>DR19</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR20</name>
					<displayName>DR20</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
