rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CAN</name>
			<description>Controller area network</description>
			<groupName>CAN</groupName>
			<baseAddress>0x40006400</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAN</name>
				<description>CAN interrupts</description>
				<value>30</value>
			</interrupt>
			<registers>
				<register>
					<name>CR_B</name>
					<displayName>CR_B</displayName>
					<description>Basic control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0021</resetValue>
					<fields>
						<field>
							<name>OIE</name>
							<description>Overflow interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIE</name>
							<description>Transmit interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RIE</name>
							<description>Receive interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RR</name>
							<description>Reset request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD_P</name>
					<displayName>MOD_P</displayName>
					<description>Peli Mode register</description>
					<alternateRegister>CR_B</alternateRegister>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>AFM</name>
							<description>Acceptance filter mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STM</name>
							<description>Self test mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LOM</name>
							<description>Listen only mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RM</name>
							<description>Reset mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMR_B</name>
					<displayName>CMR_B</displayName>
					<description>Basic Command register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00FF</resetValue>
					<fields>
						<field>
							<name>ERB</name>
							<description>Empty Rxbuffer</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CDO</name>
							<description>Clear data overrun</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RRB</name>
							<description>Release receive buffer</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AT</name>
							<description>Abort transmission</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR</name>
							<description>Transmission request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMR_P</name>
					<displayName>CMR_P</displayName>
					<description>Peli Command register</description>
					<alternateRegister>CMR_B</alternateRegister>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ERB</name>
							<description>Empty Rxbuffer</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRR</name>
							<description>Self reset request</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CDO</name>
							<description>Clear data overrun</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RRB</name>
							<description>Release receive buffer</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AT</name>
							<description>Abort transmission</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR</name>
							<description>Transmission request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000C</resetValue>
					<fields>
						<field>
							<name>BS</name>
							<description>Bus status</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ES</name>
							<description>Error status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TS</name>
							<description>Transmit status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RS</name>
							<description>Receive status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCS</name>
							<description>Transmission complete status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBS</name>
							<description>Transmit buffer status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DOS</name>
							<description>Data overrun status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RBS</name>
							<description>Receive buffer status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IR_B</name>
					<displayName>IR_B</displayName>
					<description>Interrupt register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00E0</resetValue>
					<fields>
						<field>
							<name>DOI</name>
							<description>Data overrun interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EI</name>
							<description>Error interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RI</name>
							<description>Receive interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IR_P</name>
					<displayName>IR_P</displayName>
					<description>Interrupt register</description>
					<addressOffset>0x0c</addressOffset>
					<alternateRegister>IR_B</alternateRegister>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BEI</name>
							<description>Bus error interrupt</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALI</name>
							<description>Arbitration lost interrupt</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPI</name>
							<description>Error passive interrupt</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DOI</name>
							<description>Data overrun interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EI</name>
							<description>Error interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RI</name>
							<description>Receive interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP0_ACR_B</name>
					<displayName>GROUP0_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IER_P</name>
					<displayName>IER_P</displayName>
					<description>Peli Interrupt Enable register</description>
					<alternateRegister>GROUP0_ACR_B</alternateRegister>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BEIE</name>
							<description>Bus error interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALIE</name>
							<description>Arbitration lost interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPIE</name>
							<description>Error passive interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DOIE</name>
							<description>Data overrun interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIE</name>
							<description>Transmit interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RIE</name>
							<description>Receive interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP0_AMR_B</name>
					<displayName>GROUP0_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR0</name>
					<displayName>BTR0</displayName>
					<description>Bus Timing register 0</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SJW</name>
							<description>Synchronization jump width</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BRP</name>
							<description>Baud rate prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR1</name>
					<displayName>BTR1</displayName>
					<description>Bus Timing register 1</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SAM</name>
							<description>Sampling</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEG2</name>
							<description>Time segment 2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>TSEG1</name>
							<description>Time segment 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXID0_B</name>
					<displayName>TXID0_B</displayName>
					<description>Basic TX ID register 0</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ID10</name>
							<description>Identifier bit 10</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID9</name>
							<description>Identifier bit 9</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID8</name>
							<description>Identifier bit 8</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID7</name>
							<description>Identifier bit 7</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID6</name>
							<description>Identifier bit 6</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID5</name>
							<description>Identifier bit 5</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID4</name>
							<description>Identifier bit 4</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID3</name>
							<description>Identifier bit 3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXID1_B</name>
					<displayName>TXID1_B</displayName>
					<description>Basic TX ID register 1</description>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ID2</name>
							<description>Identifier bit 2</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID1</name>
							<description>Identifier bit 1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID0</name>
							<description>Identifier bit 0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ALC_P</name>
					<displayName>ALC_P</displayName>
					<description>Peli Arbitration Lost Capture register</description>
					<alternateRegister>TXID1_B</alternateRegister>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<name>BITNO</name>
							<description>Bit number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDR0_B</name>
					<displayName>TXDR0_B</displayName>
					<description>Basic TX Data register 0</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXDR0</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ECC_P</name>
					<displayName>ECC_P</displayName>
					<description>Peli Error Code Capture register</description>
					<alternateRegister>TXDR0_B</alternateRegister>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ERRC</name>
							<description>Error code</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SEG</name>
							<description>SEG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDR1_B</name>
					<displayName>TXDR1_B</displayName>
					<description>Basic TX Data register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXDR1</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EWLR_P</name>
					<displayName>EWLR_P</displayName>
					<description>Peli Error Warning Limit register</description>
					<alternateRegister>TXDR1_B</alternateRegister>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0060</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EWL</name>
							<description>Programmable error warning limit</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDR2_B</name>
					<displayName>TXDR2_B</displayName>
					<description>Basic Send Data register 2</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXDR2</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RXERR_P</name>
					<displayName>RXERR_P</displayName>
					<description>Peli RX Error Counter register</description>
					<alternateRegister>TXDR2_B</alternateRegister>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>RXERR</name>
							<description>RX error counter register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDR3_B</name>
					<displayName>TXDR3_B</displayName>
					<description>Basic TX Data register 3</description>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXDR3</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXERR_P</name>
					<displayName>TXERR_P</displayName>
					<description>Peli TX Error Counter register</description>
					<alternateRegister>TXDR3_B</alternateRegister>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>TXERR</name>
							<description>TX error counter register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDR4_B</name>
					<displayName>TXDR4_B</displayName>
					<description>Basic TX Data register 4</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXDR4</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SFF_P</name>
					<displayName>SFF_P</displayName>
					<description>Peli Send Frame Format register</description>
					<alternateRegister>TXDR4_B</alternateRegister>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>FF</name>
							<description>Frame format</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP0_ACR0_P</name>
					<displayName>GROUP0_ACR0_P</displayName>
					<description>Peli Acceptance Code register 0</description>
					<alternateRegister>SFF_P</alternateRegister>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
