rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>GROUP2_ACR1_P</name>
					<displayName>GROUP2_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0xBC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_ACR2_P</name>
					<displayName>GROUP2_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0xC0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_ACR3_P</name>
					<displayName>GROUP2_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0xC4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_AMR_B</name>
					<displayName>GROUP2_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0xC8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_AMR0_P</name>
					<displayName>GROUP2_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP2_AMR_B</alternateRegister>
					<addressOffset>0xC8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_AMR1_P</name>
					<displayName>GROUP2_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0xCC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_AMR2_P</name>
					<displayName>GROUP2_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0xD0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP2_AMR3_P</name>
					<displayName>GROUP2_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0xD4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_ACR_B</name>
					<displayName>GROUP3_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0xD8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_ACR0_P</name>
					<displayName>GROUP3_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP3_ACR_B</alternateRegister>
					<addressOffset>0xD8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_ACR1_P</name>
					<displayName>GROUP3_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0xDC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_ACR2_P</name>
					<displayName>GROUP3_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0xE0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_ACR3_P</name>
					<displayName>GROUP3_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0xE4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_AMR_B</name>
					<displayName>GROUP3_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0xE8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_AMR0_P</name>
					<displayName>GROUP3_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP3_AMR_B</alternateRegister>
					<addressOffset>0xE8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_AMR1_P</name>
					<displayName>GROUP3_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0xEC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_AMR2_P</name>
					<displayName>GROUP3_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0xF0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP3_AMR3_P</name>
					<displayName>GROUP3_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0xF4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_ACR_B</name>
					<displayName>GROUP4_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0xF8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_ACR0_P</name>
					<displayName>GROUP4_ACR0_P</displayName>
					<description>Peli Acceptance Code register</description>
					<alternateRegister>GROUP4_ACR_B</alternateRegister>
					<addressOffset>0xF8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_ACR1_P</name>
					<displayName>GROUP4_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0xFC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_ACR2_P</name>
					<displayName>GROUP4_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_ACR3_P</name>
					<displayName>GROUP4_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_AMR_B</name>
					<displayName>GROUP4_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_AMR0_P</name>
					<displayName>GROUP4_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP4_AMR_B</alternateRegister>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_AMR1_P</name>
					<displayName>GROUP4_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_AMR2_P</name>
					<displayName>GROUP4_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP4_AMR3_P</name>
					<displayName>GROUP4_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_ACR_B</name>
					<displayName>GROUP5_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_ACR0_P</name>
					<displayName>GROUP5_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP5_ACR_B</alternateRegister>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_ACR1_P</name>
					<displayName>GROUP5_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_ACR2_P</name>
					<displayName>GROUP5_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x120</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_ACR3_P</name>
					<displayName>GROUP5_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x124</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_AMR_B</name>
					<displayName>GROUP5_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x128</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_AMR0_P</name>
					<displayName>GROUP5_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP5_AMR_B</alternateRegister>
					<addressOffset>0x128</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_AMR1_P</name>
					<displayName>GROUP5_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x12C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_AMR2_P</name>
					<displayName>GROUP5_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x130</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP5_AMR3_P</name>
					<displayName>GROUP5_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x134</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_ACR_B</name>
					<displayName>GROUP6_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x138</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_ACR0_P</name>
					<displayName>GROUP6_ACR0_P</displayName>
					<description>Peli Acceptance Code register</description>
					<alternateRegister>GROUP6_ACR_B</alternateRegister>
					<addressOffset>0x138</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_ACR1_P</name>
					<displayName>GROUP6_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x13C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_ACR2_P</name>
					<displayName>GROUP6_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x140</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_ACR3_P</name>
					<displayName>GROUP6_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x144</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_AMR_B</name>
					<displayName>GROUP6_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x148</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP6_AMR0_P</name>
					<displayName>GROUP6_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP6_AMR_B</alternateRegister>
					<addressOffset>0x148</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
