rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>GROUP11_ACR1_P</name>
					<displayName>GROUP11_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x1DC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_ACR2_P</name>
					<displayName>GROUP11_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x1E0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_ACR3_P</name>
					<displayName>GROUP11_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x1E4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_AMR_B</name>
					<displayName>GROUP11_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x1E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_AMR0_P</name>
					<displayName>GROUP11_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP11_AMR_B</alternateRegister>
					<addressOffset>0x1E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_AMR1_P</name>
					<displayName>GROUP11_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x1EC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_AMR2_P</name>
					<displayName>GROUP11_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x1F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP11_AMR3_P</name>
					<displayName>GROUP11_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x1F4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_ACR_B</name>
					<displayName>GROUP12_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x1F8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_ACR0_P</name>
					<displayName>GROUP12_ACR0_P</displayName>
					<description>Peli Acceptance Code register</description>
					<alternateRegister>GROUP12_ACR_B</alternateRegister>
					<addressOffset>0x1F8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_ACR1_P</name>
					<displayName>GROUP12_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x1FC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_ACR2_P</name>
					<displayName>GROUP12_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_ACR3_P</name>
					<displayName>GROUP12_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x204</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_AMR_B</name>
					<displayName>GROUP12_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x208</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_AMR0_P</name>
					<displayName>GROUP12_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP12_AMR_B</alternateRegister>
					<addressOffset>0x208</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_AMR1_P</name>
					<displayName>GROUP12_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x20C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_AMR2_P</name>
					<displayName>GROUP12_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x210</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP12_AMR3_P</name>
					<displayName>GROUP12_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x214</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_ACR_B</name>
					<displayName>GROUP13_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x218</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_ACR0_P</name>
					<displayName>GROUP13_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP13_ACR_B</alternateRegister>
					<addressOffset>0x218</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_ACR1_P</name>
					<displayName>GROUP13_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x21C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_ACR2_P</name>
					<displayName>GROUP13_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x220</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_ACR3_P</name>
					<displayName>GROUP13_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x224</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_AMR_B</name>
					<displayName>GROUP13_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x228</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_AMR0_P</name>
					<displayName>GROUP13_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP13_AMR_B</alternateRegister>
					<addressOffset>0x228</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_AMR1_P</name>
					<displayName>GROUP13_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x22C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_AMR2_P</name>
					<displayName>GROUP13_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x230</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP13_AMR3_P</name>
					<displayName>GROUP13_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x234</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_ACR_B</name>
					<displayName>GROUP14_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x238</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_ACR0_P</name>
					<displayName>GROUP14_ACR0_P</displayName>
					<description>Peli Acceptance Code register</description>
					<alternateRegister>GROUP14_ACR_B</alternateRegister>
					<addressOffset>0x238</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_ACR1_P</name>
					<displayName>GROUP14_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x23C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_ACR2_P</name>
					<displayName>GROUP14_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x240</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_ACR3_P</name>
					<displayName>GROUP14_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x244</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_AMR_B</name>
					<displayName>GROUP14_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x248</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_AMR0_P</name>
					<displayName>GROUP14_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP14_AMR_B</alternateRegister>
					<addressOffset>0x248</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_AMR1_P</name>
					<displayName>GROUP14_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x24C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_AMR2_P</name>
					<displayName>GROUP14_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x250</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP14_AMR3_P</name>
					<displayName>GROUP14_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x254</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_ACR_B</name>
					<displayName>GROUP15_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x258</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_ACR0_P</name>
					<displayName>GROUP15_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP15_ACR_B</alternateRegister>
					<addressOffset>0x258</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_ACR1_P</name>
					<displayName>GROUP15_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x25C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_ACR2_P</name>
					<displayName>GROUP15_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x260</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_ACR3_P</name>
					<displayName>GROUP15_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x264</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_AMR_B</name>
					<displayName>GROUP15_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x268</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_AMR0_P</name>
					<displayName>GROUP15_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP15_AMR_B</alternateRegister>
					<addressOffset>0x268</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
