rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>GROUP15_AMR1_P</name>
					<displayName>GROUP15_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x26C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_AMR2_P</name>
					<displayName>GROUP15_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x270</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP15_AMR3_P</name>
					<displayName>GROUP15_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x274</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_ACR_B</name>
					<displayName>GROUP16_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x278</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_ACR0_P</name>
					<displayName>GROUP16_ACR0_P</displayName>
					<description>Peli Acceptance Code register</description>
					<alternateRegister>GROUP16_ACR_B</alternateRegister>
					<addressOffset>0x278</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_ACR1_P</name>
					<displayName>GROUP16_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x27C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_ACR2_P</name>
					<displayName>GROUP16_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x280</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_ACR3_P</name>
					<displayName>GROUP16_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x284</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_AMR_B</name>
					<displayName>GROUP16_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x288</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_AMR0_P</name>
					<displayName>GROUP16_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP16_AMR_B</alternateRegister>
					<addressOffset>0x288</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_AMR1_P</name>
					<displayName>GROUP16_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x28C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_AMR2_P</name>
					<displayName>GROUP16_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x290</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP16_AMR3_P</name>
					<displayName>GROUP16_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x294</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_ACR_B</name>
					<displayName>GROUP17_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x298</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_ACR0_P</name>
					<displayName>GROUP17_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP17_ACR_B</alternateRegister>
					<addressOffset>0x298</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_ACR1_P</name>
					<displayName>GROUP17_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x29C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_ACR2_P</name>
					<displayName>GROUP17_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x2A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_ACR3_P</name>
					<displayName>GROUP17_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x2A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_AMR_B</name>
					<displayName>GROUP17_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x2A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_AMR0_P</name>
					<displayName>GROUP17_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP17_AMR_B</alternateRegister>
					<addressOffset>0x2A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_AMR1_P</name>
					<displayName>GROUP17_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x2AC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_AMR2_P</name>
					<displayName>GROUP17_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x2B0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP17_AMR3_P</name>
					<displayName>GROUP17_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x2B4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_ACR_B</name>
					<displayName>GROUP18_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x2B8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_ACR0_P</name>
					<displayName>GROUP18_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP18_ACR_B</alternateRegister>
					<addressOffset>0x2B8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_ACR1_P</name>
					<displayName>GROUP18_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x2BC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_ACR2_P</name>
					<displayName>GROUP18_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x2C0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_ACR3_P</name>
					<displayName>GROUP18_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x2C4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_AMR_B</name>
					<displayName>GROUP18_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x2C8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_AMR0_P</name>
					<displayName>GROUP18_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP18_AMR_B</alternateRegister>
					<addressOffset>0x2C8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_AMR1_P</name>
					<displayName>GROUP18_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x2CC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_AMR2_P</name>
					<displayName>GROUP18_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x2D0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP18_AMR3_P</name>
					<displayName>GROUP18_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x2D4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_ACR_B</name>
					<displayName>GROUP19_ACR_B</displayName>
					<description>Basic Acceptance Code register</description>
					<addressOffset>0x2D8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_ACR0_P</name>
					<displayName>GROUP19_ACR0_P</displayName>
					<description>Peli Acceptance Code register0</description>
					<alternateRegister>GROUP19_ACR_B</alternateRegister>
					<addressOffset>0x2D8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_ACR1_P</name>
					<displayName>GROUP19_ACR1_P</displayName>
					<description>Peli Acceptance Code register1</description>
					<addressOffset>0x2DC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_ACR2_P</name>
					<displayName>GROUP19_ACR2_P</displayName>
					<description>Peli Acceptance Code register2</description>
					<addressOffset>0x2E0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_ACR3_P</name>
					<displayName>GROUP19_ACR3_P</displayName>
					<description>Peli Acceptance Code register3</description>
					<addressOffset>0x2E4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AC</name>
							<description>Acceptance code</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_AMR_B</name>
					<displayName>GROUP19_AMR_B</displayName>
					<description>Basic Acceptance Mask register</description>
					<addressOffset>0x2E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_AMR0_P</name>
					<displayName>GROUP19_AMR0_P</displayName>
					<description>Peli Acceptance Mask register 0</description>
					<alternateRegister>GROUP19_AMR_B</alternateRegister>
					<addressOffset>0x2E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_AMR1_P</name>
					<displayName>GROUP19_AMR1_P</displayName>
					<description>Peli Acceptance Mask register 1</description>
					<addressOffset>0x2EC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_AMR2_P</name>
					<displayName>GROUP19_AMR2_P</displayName>
					<description>Peli Acceptance Mask register 2</description>
					<addressOffset>0x2F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GROUP19_AMR3_P</name>
					<displayName>GROUP19_AMR3_P</displayName>
					<description>Peli Acceptance Mask register 3</description>
					<addressOffset>0x2F4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>AM</name>
							<description>Acceptance mask</description>
						</field>
					</fields>
				</register>
