rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP</name>
			<description>Comparator</description>
			<groupName>COMP</groupName>
			<baseAddress>0x40013C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>COMP1_CSR</name>
					<displayName>COMP1_CSR</displayName>
					<description>COMP1 Control State Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 1 lock</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 1 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 1 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_SEL</name>
							<description>Comparator 1 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP_SEL</name>
							<description>Comparator 1 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INM_SEL</name>
							<description>Comparator 1 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 1 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP2_CSR</name>
					<displayName>COMP2_CSR</displayName>
					<description>COMP2 Control State Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 2 lock</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 2 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 2 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_SEL</name>
							<description>Comparator 2 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP_SEL</name>
							<description>Comparator 2 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INM_SEL</name>
							<description>Comparator 2 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 2 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 2 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP_CRV</name>
					<displayName>COMP_CRV</displayName>
					<description>COMP Extern Reference Voltage</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>CRV_SRC</name>
							<description>Comparator external reference voltage source select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRV_EN</name>
							<description>Comparator external reference voltage enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRV_SEL</name>
							<description>Comparator external reference voltage select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP1_POLL</name>
					<displayName>COMP1_POLL</displayName>
					<description>COMP1 Polling Output Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>POUT</name>
							<description>Comparator 1 Polling output</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PERIOD</name>
							<description>Comparator 1 polling wait cycle</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>FIXN</name>
							<description>Comparator 1 Polling inverting input fix</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POLL_CH</name>
							<description>Comparator 1 polling pollingchannel</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POLL_EN</name>
							<description>Comparator 1 polling enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP2_POLL</name>
					<displayName>COMP2_POLL</displayName>
					<description>COMP2 Polling Output Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>POUT</name>
							<description>Comparator 2 Polling output</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PERIOD</name>
							<description>Comparator 2 polling wait cycle</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>FIXN</name>
							<description>Comparator 2 Polling inverting input fix</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POLL_CH</name>
							<description>Comparator 2 polling channel</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POLL_EN</name>
							<description>Comparator 2 polling enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
