rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description>
			<groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DR</name>
							<description>Data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>Independent data register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>IDR</name>
							<description>General-purpose 8-bit data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RESET</name>
							<description>CRC reset</description>
						</field>
					</fields>
				</register>
				<register>
					<name>REVERSE</name>
					<displayName>REVERSE</displayName>
					<description>Reversed data register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>REVERSE</name>
							<description>Data reverse register bits</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CSM</name>
			<description>Debug support</description>
			<groupName>CSM</groupName>
			<baseAddress>0x40006800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>TXREG1</name>
					<displayName>TXREG1</displayName>
					<description>Transmit register 1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXREG1</name>
							<description>Transfer data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXREG2</name>
					<displayName>TXREG2</displayName>
					<description>Transmit register 2</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXREG2</name>
							<description>Transfer data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RXREG1</name>
					<displayName>RXREG1</displayName>
					<description>Reveive register 1</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>RXREG1</name>
							<description>Receive data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RXREG2</name>
					<displayName>RXREG2</displayName>
					<description>Reveive register 2</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>RXREG2</name>
							<description>Receive data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTAT</name>
					<displayName>INTSTAT</displayName>
					<description>Interrupt Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STOP_INTF</name>
							<description>Stop Reveive data interrupt flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>START_INTF</name>
							<description>Start Reveive data interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXC_INTF</name>
							<description>Transmit complete interrupt flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_INTF</name>
							<description>Receive data available interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_INTF</name>
							<description>Transmit FIFO available interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<displayName>INTEN</displayName>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STOP_IEN</name>
							<description>Stop Reveive data interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>START_IEN</name>
							<description>Start Reveive data interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXC_IEN</name>
							<description>Transmit complete interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_IEN</name>
							<description>Receive data available interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_IEN</name>
							<description>Transmit FIFO available interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTL1</name>
					<displayName>CTL1</displayName>
					<description>Control Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>TXSEL1</name>
							<description>TXandRX data select control</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN1</name>
							<description>DMA enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INSEL1</name>
							<description>input signal select</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDLEP1</name>
							<description>idel state polority</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN1</name>
							<description>enable Control bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTL2</name>
					<displayName>CTL2</displayName>
					<description>Control Register 2</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>TXSEL2</name>
							<description>TXandRX data select control</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN2</name>
							<description>DMA enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INSEL2</name>
							<description>input signal select</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDLEP2</name>
							<description>idel state polority</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN2</name>
							<description>enable Control bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>Configure Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>MAXBIT</name>
							<description>max tx and rx bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>VTXSEL</name>
							<description>Vtx select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VTXEN</name>
							<description>Vtx enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSEL</name>
							<description>master or slave select</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOPSEL</name>
							<description>stop select</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STARTSEL</name>
							<description>start select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SPBRG</name>
					<displayName>SPBRG</displayName>
					<description>Baud rate register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>SPBRG</name>
							<description>baud rate control register for simple data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>BCNT</name>
					<displayName>BCNT</displayName>
					<description>bit count</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>send or receive bit count</description>
						</field>
					</fields>
				</register>
