rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DBG</name>
			<description>Debug support</description>
			<groupName>DBG</groupName>
			<baseAddress>0x40013400</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>ID CODE</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DEV_ID</name>
							<description>Device identifier</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBG_TIM1x_STOP</name>
							<description>TIMx counter stopped when core is halted (x = 16,17,14)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DBG_CAN_STOP</name>
							<description>CAN stopped when core is halted</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMx_STOP</name>
							<description>TIMx counter stopped when core is halted (x = 3,2,1)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DBG_WWDG_STOP</name>
							<description>Debug window watchdog when core is halted</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_IWDG_STOP</name>
							<description>Debug independent watchdog stopped when core is stopped</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP_FOR_LDO</name>
							<description>Debug Stop Ldo</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STANDBY</name>
							<description>Debug Standby mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP</name>
							<description>Debug Stop mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_SLEEP</name>
							<description>Debug Sleep mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVICE</name>
			<description>DEVICE</description>
			<groupName>DEVICE</groupName>
			<baseAddress>0x1FFFF7E8</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>UID1</name>
					<displayName>UID1</displayName>
					<description>Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>31:0 unique ID bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>UID2</name>
					<displayName>UID2</displayName>
					<description>Configuration register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>63:32 unique ID bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>UID3</name>
					<displayName>UID3</displayName>
					<description>Configuration register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>95:64 unique ID bits</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DMA1</name>
			<description>Direct Momory Accessuart</description>
			<groupName>DMA1</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA1_Channel1</name>
				<description>DMA1 Channel1 global interrupt</description>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel2_3</name>
				<description>DMA1 Channel2_3 global interrupt</description>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel4_5</name>
				<description>DMA1 Channel4_5 global interrupt</description>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>DMA_ISR</name>
					<displayName>DMA_ISR</displayName>
					<description>DMA interrupt status register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TEIF5</name>
							<description>channel 5 transfer error flag</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF5</name>
							<description>channel 5 half transfer flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF5</name>
							<description>channel 5 transfer complete flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF5</name>
							<description>channel 5 global interrupt flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF4</name>
							<description>channel 4 transfer error flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF4</name>
							<description>channel 4 half transfer flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF4</name>
							<description>channel 4 transfer complete flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF4</name>
							<description>channel 4 global interrupt flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF3</name>
							<description>channel 3 transfer error flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF3</name>
							<description>channel 3 half transfer flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF3</name>
							<description>channel 3 transfer complete flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF3</name>
							<description>channel 3 global interrupt flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF2</name>
							<description>channel 2 transfer error flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF2</name>
							<description>channel 2 half transfer flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF2</name>
							<description>channel 2 transfer complete flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF2</name>
							<description>channel 2 global interrupt flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF1</name>
							<description>channel 1 transfer error flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF1</name>
							<description>channel 1 half transfer flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF1</name>
							<description>channel 1 transfer complete flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF1</name>
							<description>channel 1 global interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_IFCR</name>
					<displayName>DMA_IFCR</displayName>
					<description>DMA interrupt flag clear reigster</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CTEIF5</name>
							<description>channel 5 transfer error clear</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF5</name>
							<description>channel 5 half transfer clear</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF5</name>
							<description>channel 5 transfer complete clear</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF5</name>
							<description>channel 5 global interrupt clear</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF4</name>
							<description>channel 4 transfer error clear</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF4</name>
							<description>channel 4 half transfer clear</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF4</name>
							<description>channel 4 transfer complete clear</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF4</name>
							<description>channel 4 global interrupt clear</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF3</name>
							<description>channel 3 transfer error clear</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF3</name>
							<description>channel 3 half transfer clear</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF3</name>
							<description>channel 3 transfer complete clear</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF3</name>
							<description>channel 3 global interrupt clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF2</name>
							<description>channel 2 transfer error clear</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF2</name>
							<description>channel 2 half transfer clear</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF2</name>
							<description>channel 2 transfer complete clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF2</name>
							<description>channel 2 global interrupt clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF1</name>
							<description>channel 1 transfer error clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF1</name>
							<description>channel 1 half transfer clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF1</name>
							<description>channel 1 transfer complete clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF1</name>
							<description>channel 1 global interrupt clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_CCR1</name>
					<displayName>DMA_CCR1</displayName>
					<description>DMA channel 1 configuration reigster</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARE</name>
							<description>Auto Reload</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Channel priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MINC</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINC</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRC</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIE</name>
							<description>Transfer error interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIE</name>
							<description>Half transfer interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register derivedFrom="DMA_CCR1">
					<name>DMA_CCR2</name>
					<displayName>DMA_CCR2</displayName>
					<addressOffset>0x1c</addressOffset>
				</register>
				<register derivedFrom="DMA_CCR1">
					<name>DMA_CCR3</name>
					<displayName>DMA_CCR3</displayName>
					<addressOffset>0x30</addressOffset>
				</register>
				<register derivedFrom="DMA_CCR1">
					<name>DMA_CCR4</name>
					<displayName>DMA_CCR4</displayName>
					<addressOffset>0x44</addressOffset>
				</register>
				<register derivedFrom="DMA_CCR1">
					<name>DMA_CCR5</name>
					<displayName>DMA_CCR5</displayName>
					<addressOffset>0x58</addressOffset>
				</register>
				<register>
					<name>DMA_CNDTR1</name>
					<displayName>DMA_CNDTR1</displayName>
					<description>DMA channel 1 number of data register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register derivedFrom="DMA_CNDTR1">
					<name>DMA_CNDTR2</name>
					<displayName>DMA_CNDTR2</displayName>
					<addressOffset>0x20</addressOffset>
				</register>
				<register derivedFrom="DMA_CNDTR1">
					<name>DMA_CNDTR3</name>
					<displayName>DMA_CNDTR3</displayName>
					<addressOffset>0x34</addressOffset>
				</register>
				<register derivedFrom="DMA_CNDTR1">
					<name>DMA_CNDTR4</name>
					<displayName>DMA_CNDTR4</displayName>
					<addressOffset>0x48</addressOffset>
				</register>
				<register derivedFrom="DMA_CNDTR1">
					<name>DMA_CNDTR5</name>
					<displayName>DMA_CNDTR5</displayName>
					<addressOffset>0x5c</addressOffset>
				</register>
				<register>
					<name>DMA_CPAR1</name>
					<displayName>DMA_CPAR1</displayName>
					<description>DMA channel 1 peripheral address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register derivedFrom="DMA_CPAR1">
					<name>DMA_CPAR2</name>
					<displayName>DMA_CPAR2</displayName>
					<addressOffset>0x24</addressOffset>
				</register>
				<register derivedFrom="DMA_CPAR1">
					<name>DMA_CPAR3</name>
					<displayName>DMA_CPAR3</displayName>
					<addressOffset>0x38</addressOffset>
				</register>
				<register derivedFrom="DMA_CPAR1">
					<name>DMA_CPAR4</name>
					<displayName>DMA_CPAR4</displayName>
					<addressOffset>0x4c</addressOffset>
				</register>
				<register derivedFrom="DMA_CPAR1">
					<name>DMA_CPAR5</name>
					<displayName>DMA_CPAR5</displayName>
					<addressOffset>0x60</addressOffset>
				</register>
				<register>
					<name>DMA_CMAR1</name>
					<displayName>DMA_CMAR1</displayName>
					<description>DMA channel 1 memory address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register derivedFrom="DMA_CMAR1">
					<name>DMA_CMAR2</name>
					<displayName>DMA_CMAR2</displayName>
					<addressOffset>0x28</addressOffset>
				</register>
				<register derivedFrom="DMA_CMAR1">
					<name>DMA_CMAR3</name>
					<displayName>DMA_CMAR3</displayName>
					<addressOffset>0x3c</addressOffset>
				</register>
				<register derivedFrom="DMA_CMAR1">
					<name>DMA_CMAR4</name>
					<displayName>DMA_CMAR4</displayName>
					<addressOffset>0x50</addressOffset>
				</register>
				<register derivedFrom="DMA_CMAR1">
					<name>DMA_CMAR5</name>
					<displayName>DMA_CMAR5</displayName>
					<addressOffset>0x64</addressOffset>
				</register>
