rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>EXTI</name>
			<description>External interrupt/event controller</description>
			<groupName>EXTI</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXTI0_1</name>
				<description>EXTI Line0_1 interrupt</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EXTI2_3</name>
				<description>EXTI Line2_3 interrupt</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EXTI4_15</name>
				<description>EXTI Line4_15 interrupt</description>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PA11_PA12_RMP</name>
							<description>PA11 PA12 remap</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSMCH1_DMA_RMP</name>
							<description>CSMCH1 DMA remap</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSMCH2_DMA_RMP</name>
							<description>CSMCH2 DMA remap</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17_DMA_RMP</name>
							<description>Timer 17 DMA remap</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16_DMA_RMP</name>
							<description>Timer 16 DMA remap</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1_RX_DMA_RMP</name>
							<description>UART1 RX DMA remap</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1_TX_DMA_RMP</name>
							<description>UART1 TX DMA remap</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_DMA_RMP</name>
							<description>ADC DMA remap</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PA12_RERMP</name>
							<description>PA12 DMA remap</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PA11_RERMP</name>
							<description>PA11 DMA remap</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MEM_MODE</name>
							<description>EXTI_Memory Remap Config</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>External interrupt configuration register 1</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI3</name>
							<description>EXTI 3 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI2</name>
							<description>EXTI 2 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI1</name>
							<description>EXTI 1 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI0</name>
							<description>EXTI 0 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<displayName>CR2</displayName>
					<description>External interrupt configuration register 2</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI7</name>
							<description>EXTI 7 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI6</name>
							<description>EXTI 6 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI5</name>
							<description>EXTI 5 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI4</name>
							<description>EXTI 4 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR3</name>
					<displayName>CR3</displayName>
					<description>External interrupt configuration register 3</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI11</name>
							<description>EXTI 11 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI10</name>
							<description>EXTI 10 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI9</name>
							<description>EXTI 9 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI8</name>
							<description>EXTI 8 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR4</name>
					<displayName>CR4</displayName>
					<description>External interrupt configuration register 4</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI15</name>
							<description>EXTI 15 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI14</name>
							<description>EXTI 14 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI13</name>
							<description>EXTI 13 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI12</name>
							<description>EXTI 12 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PADHYS</name>
					<displayName>PADHYS</displayName>
					<description>PAD configuration register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<name>I2C1_mode_sel</name>
							<description>I2C1 mode selection</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>Interrupt mask register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IMR24</name>
							<description>Interrupt Mask on line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR20</name>
							<description>Interrupt Mask on line 20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR19</name>
							<description>Interrupt Mask on line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR18</name>
							<description>Interrupt Mask on line 18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR17</name>
							<description>Interrupt Mask on line 17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR16</name>
							<description>Interrupt Mask on line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR15</name>
							<description>Interrupt Mask on line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR14</name>
							<description>Interrupt Mask on line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR13</name>
							<description>Interrupt Mask on line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR12</name>
							<description>Interrupt Mask on line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR11</name>
							<description>Interrupt Mask on line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR10</name>
							<description>Interrupt Mask on line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR9</name>
							<description>Interrupt Mask on line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR8</name>
							<description>Interrupt Mask on line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR7</name>
							<description>Interrupt Mask on line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR6</name>
							<description>Interrupt Mask on line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR5</name>
							<description>Interrupt Mask on line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR4</name>
							<description>Interrupt Mask on line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR3</name>
							<description>Interrupt Mask on line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR2</name>
							<description>Interrupt Mask on line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR1</name>
							<description>Interrupt Mask on line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR0</name>
							<description>Interrupt Mask on line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<displayName>EMR</displayName>
					<description>Event mask register</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EMR24</name>
							<description>Event Mask on line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR20</name>
							<description>Event Mask on line 20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR19</name>
							<description>Event Mask on line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR18</name>
							<description>Event Mask on line 18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR17</name>
							<description>Event Mask on line 17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR16</name>
							<description>Event Mask on line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR15</name>
							<description>Event Mask on line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR14</name>
							<description>Event Mask on line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR13</name>
							<description>Event Mask on line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR12</name>
							<description>Event Mask on line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR11</name>
							<description>Event Mask on line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR10</name>
							<description>Event Mask on line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR9</name>
							<description>Event Mask on line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR8</name>
							<description>Event Mask on line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR7</name>
							<description>Event Mask on line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR6</name>
							<description>Event Mask on line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR5</name>
							<description>Event Mask on line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR4</name>
							<description>Event Mask on line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR3</name>
							<description>Event Mask on line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR2</name>
							<description>Event Mask on line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR1</name>
							<description>Event Mask on line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR0</name>
							<description>Event Mask on line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RTSR</name>
					<displayName>RTSR</displayName>
					<description>Rising trigger selection register</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TR24</name>
							<description>Rising trigger event configuration bit of line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR20</name>
							<description>Rising trigger event configuration bit of line 20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR19</name>
							<description>Rising trigger event configuration bit of line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR18</name>
							<description>Rising trigger event configuration bit of line 18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR17</name>
							<description>Rising trigger event configuration bit of line 17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR16</name>
							<description>Rising trigger event configuration bit of line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR15</name>
							<description>Rising trigger event configuration bit of line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR14</name>
							<description>Rising trigger event configuration bit of line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR13</name>
							<description>Rising trigger event configuration bit of line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR12</name>
							<description>Rising trigger event configuration bit of line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR11</name>
							<description>Rising trigger event configuration bit of line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR10</name>
							<description>Rising trigger event configuration bit of line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR9</name>
							<description>Rising trigger event configuration bit of line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR8</name>
							<description>Rising trigger event configuration bit of line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR7</name>
							<description>Rising trigger event configuration bit of line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR6</name>
							<description>Rising trigger event configuration bit of line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR5</name>
							<description>Rising trigger event configuration bit of line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR4</name>
							<description>Rising trigger event configuration bit of line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR3</name>
							<description>Rising trigger event configuration bit of line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR2</name>
							<description>Rising trigger event configuration bit of line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR1</name>
							<description>Rising trigger event configuration bit of line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR0</name>
							<description>Rising trigger event configuration bit of line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
