rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>AHBRSTR</name>
					<displayName>AHBRSTR</displayName>
					<description>Advanced High Performance Bus Reset Register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HWDIV</name>
							<description>HWDIV reset</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOD</name>
							<description>GPIOD reset</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOC</name>
							<description>GPIOC reset</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOB</name>
							<description>GPIOB reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOA</name>
							<description>GPIOA reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<displayName>CFGR2</displayName>
					<description>Configure Register 2</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>TIMADV_PRE</name>
							<description>TIMADV lock prescaler</description>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>TIMADV_CLKSEL</name>
							<description>TIMADV clock selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RNG</name>
					<displayName>RNG</displayName>
					<description>Random number register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RNG_DATA</name>
							<description>RNG data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>RNG_DONE</name>
							<description>RNG done</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG_LDSD</name>
							<description>RNG load seed</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG_EN</name>
							<description>RNG enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCFG</name>
					<displayName>SYSCFG</displayName>
					<description>System Configuration Register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00100C03</resetValue>
					<fields>
						<field>
							<name>SECTOR_1K_CFG</name>
							<description>The size of flash page erase</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PROG_CHECK_EN</name>
							<description>Whether to check if the data in Flash is 0xFF when writing Flash</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description>Real time clock</description>
			<groupName>RTC</groupName>
			<baseAddress>0x40002800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x30</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC_BKP</name>
				<description>RTC and BKP global interrupt</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>RTC_CRH</name>
					<displayName>RTC_CRH</displayName>
					<description>RTC configuration high register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OWIE</name>
							<description>Overflow interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALRIE</name>
							<description>Alarm interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SECIE</name>
							<description>Second interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_CRL</name>
					<displayName>RTC_CRL</displayName>
					<description>RTC configuration low register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0020</resetValue>
					<fields>
						<field>
							<name>ALPEN</name>
							<description>RTC alarm loop enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTOFF</name>
							<description>RTC operation OFF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNF</name>
							<description>Configuration flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSF</name>
							<description>Registers synchronized flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OWF</name>
							<description>Overflow flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALRF</name>
							<description>Alarm flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SECF</name>
							<description>Second flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_PRLH</name>
					<displayName>RTC_PRLH</displayName>
					<description>RTC Prescaler load high register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>PRL</name>
							<description>RTC prescaler reload value high</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_PRLL</name>
					<displayName>RTC_PRLL</displayName>
					<description>RTC Prescaler load low register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>PRL</name>
							<description>RTC prescaler reload value low</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_DIVH</name>
					<displayName>RTC_DIVH</displayName>
					<description>RTC prescaler divider factor high register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>DIV</name>
							<description>RTC clock divider high</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_DIVL</name>
					<displayName>RTC_DIVL</displayName>
					<description>RTC prescaler divider factor low register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>DIV</name>
							<description>RTC clock divider low</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_CNTH</name>
					<displayName>RTC_CNTH</displayName>
					<description>RTC counter high register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>RTC counter high</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_CNTL</name>
					<displayName>RTC_CNTL</displayName>
					<description>RTC counter low register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>RTC counter low</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_ALRH</name>
					<displayName>RTC_ALRH</displayName>
					<description>RTC alarm high register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>ALR</name>
							<description>RTC alarm high</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_ALRL</name>
					<displayName>RTC_ALRL</displayName>
					<description>RTC alarm low register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>ALR</name>
							<description>RTC alarm low</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_MSRH</name>
					<displayName>RTC_MSRH</displayName>
					<description>RTC millisecond alarm high register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>MSR</name>
							<description>RTC msec high</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_MSRL</name>
					<displayName>RTC_MSRL</displayName>
					<description>RTC millisecond alarm low register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>MSR</name>
							<description>RTC msec low</description>
						</field>
					</fields>
				</register>
