rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="UART1">
			<name>UART2</name>
			<baseAddress>0x40004400</baseAddress>
			<interrupt>
				<name>UART2</name>
				<description>UART2 global interrupt</description>
				<value>28</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>USB</name>
			<description>Universal serial bus full-speed device interface</description>
			<groupName>USB</groupName>
			<baseAddress>0x40005C00</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB_FS</name>
				<description>USB Device FS</description>
				<value>31</value>
			</interrupt>
			<registers>
				<register>
					<name>TOP</name>
					<displayName>TOP</displayName>
					<description>USB_TOP</description>
					<addressOffset>0x00</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00000002</resetValue>
					<fields>
						<field>
							<name>ACTIVE</name>
							<description>USB bus is active</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DP_DMSTATE</name>
							<description>Current USB DP/DM line state</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SUSPEND</name>
							<description>USB suspend state</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESET</name>
							<description>Reset EP and FIFO in USB controller</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONNECT</name>
							<description>USB connection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPEED</name>
							<description>SPEED</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INT_STATE</name>
					<displayName>INT_STATE</displayName>
					<description>interrupt state register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EPINTF</name>
							<description>EP interrupt received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SOFF</name>
							<description>BUS received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESUMF</name>
							<description>BUS resume received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SUSPENDF</name>
							<description>BUS suspend received</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTF</name>
							<description>BUS reset received</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_INT_STATE</name>
					<displayName>EP_INT_STATE</displayName>
					<description>EP interrupt state register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EP4F</name>
							<description>EP4 interrupt received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3F</name>
							<description>EP3 interrupt received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2F</name>
							<description>EP2 interrupt received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1F</name>
							<description>EP1 interrupt received</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0F</name>
							<description>EP0 interrupt received</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0_INT_STATE</name>
					<displayName>EP0_INT_STATE</displayName>
					<description>EP0 interrupt state register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLF</name>
							<description>OUT-STALL received</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKF</name>
							<description>OUT-ACK received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKF</name>
							<description>OUT-NACK received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLF</name>
							<description>IN-STALL received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKF</name>
							<description>IN-ACK received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKF</name>
							<description>IN-NACK received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>END</name>
							<description>Status stage finished</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETUP</name>
							<description>SETUP packet received</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INT_EN</name>
					<displayName>INT_EN</displayName>
					<description>interrupt enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>INTMASK</name>
							<description>interrupt mask</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPIE</name>
							<description>EP interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SOFIE</name>
							<description>SOF interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESUMIE</name>
							<description>BUS resume interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SUSPENDIE</name>
							<description>BUS suspend interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTIE</name>
							<description>BUS reset interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_INT_EN</name>
					<displayName>EP_INT_EN</displayName>
					<description>EP interrupt enable register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EP4IE</name>
							<description>EP4 interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3IE</name>
							<description>EP3 interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2IE</name>
							<description>EP2 interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1IE</name>
							<description>EP1 interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0IE</name>
							<description>EP0 interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0_INT_EN</name>
					<displayName>EP0_INT_EN</displayName>
					<description>EP0 interrupt enable register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLIE</name>
							<description>OUT-STALL interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKIE</name>
							<description>OUT-ACK interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKIE</name>
							<description>OUT-NACK interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLIE</name>
							<description>IN-STALL interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKIE</name>
							<description>IN-ACK interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKIE</name>
							<description>IN-NACK interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENDIE</name>
							<description>Status stage finished interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETUPIE</name>
							<description>SETUP packet interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP1_INT_STATE</name>
					<displayName>EP1_INT_STATE</displayName>
					<description>EP1 interrupt state register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLF</name>
							<description>OUT-STALL received</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKF</name>
							<description>OUT-ACK received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKF</name>
							<description>OUT-NACK received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLF</name>
							<description>IN-STALL received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKF</name>
							<description>IN-ACK received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACF</name>
							<description>IN-NACK received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>END</name>
							<description>Status stage finished</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP2_INT_STATE</name>
					<displayName>EP2_INT_STATE</displayName>
					<description>EP2 interrupt state register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLF</name>
							<description>OUT-STALL received</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKF</name>
							<description>OUT-ACK received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKF</name>
							<description>OUT-NACK received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLF</name>
							<description>IN-STALL received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKF</name>
							<description>IN-ACK received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACF</name>
							<description>IN-NACK received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>END</name>
							<description>Status stage finished</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP3_INT_STATE</name>
					<displayName>EP3_INT_STATE</displayName>
					<description>EP3 interrupt state register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLF</name>
							<description>OUT-STALL received</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKF</name>
							<description>OUT-ACK received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKF</name>
							<description>OUT-NACK received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLF</name>
							<description>IN-STALL received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKF</name>
							<description>IN-ACK received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACF</name>
							<description>IN-NACK received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>END</name>
							<description>Status stage finished</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP4_INT_STATE</name>
					<displayName>EP4_INT_STATE</displayName>
					<description>EP4 interrupt state register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLF</name>
							<description>OUT-STALL received</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKF</name>
							<description>OUT-ACK received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKF</name>
							<description>OUT-NACK received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLF</name>
							<description>IN-STALL received</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKF</name>
							<description>IN-ACK received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACF</name>
							<description>IN-NACK received</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>END</name>
							<description>Status stage finished</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP1_INT_EN</name>
					<displayName>EP1_INT_EN</displayName>
					<description>EP1 interrupt enable register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLIE</name>
							<description>OUT-STALL interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKIE</name>
							<description>OUT-ACK interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKIE</name>
							<description>OUT-NACK interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLIE</name>
							<description>IN-STALL interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKIE</name>
							<description>IN-ACK interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKIE</name>
							<description>IN-NACK interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENDIE</name>
							<description>Status stage finished interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP2_INT_EN</name>
					<displayName>EP2_INT_EN</displayName>
					<description>EP2 interrupt enable register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLIE</name>
							<description>OUT-STALL interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKIE</name>
							<description>OUT-ACK interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKIE</name>
							<description>OUT-NACK interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLIE</name>
							<description>IN-STALL interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKIE</name>
							<description>IN-ACK interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKIE</name>
							<description>IN-NACK interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENDIE</name>
							<description>Status stage finished interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP3_INT_EN</name>
					<displayName>EP3_INT_EN</displayName>
					<description>EP3 interrupt enable register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLIE</name>
							<description>OUT-STALL interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKIE</name>
							<description>OUT-ACK interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKIE</name>
							<description>OUT-NACK interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLIE</name>
							<description>IN-STALL interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKIE</name>
							<description>IN-ACK interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKIE</name>
							<description>IN-NACK interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENDIE</name>
							<description>Status stage finished interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP4_INT_EN</name>
					<displayName>EP4_INT_EN</displayName>
					<description>EP4 interrupt enable register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_STALLIE</name>
							<description>OUT-STALL interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_ACKIE</name>
							<description>OUT-ACK interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_NACKIE</name>
							<description>OUT-NACK interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_STALLIE</name>
							<description>IN-STALL interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_ACKIE</name>
							<description>IN-ACK interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_NACKIE</name>
							<description>IN-NACK interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENDIE</name>
							<description>Status stage finished interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
