rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>ADDR</name>
					<displayName>ADDR</displayName>
					<description>USB address</description>
					<addressOffset>0x60</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<name>ADDR</name>
							<description>USB address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_EN</name>
					<displayName>EP_EN</displayName>
					<description>EP Enable End</description>
					<addressOffset>0x64</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EP4EN</name>
							<description>Enable End Point 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3EN</name>
							<description>Enable End Point 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2EN</name>
							<description>Enable End Point 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1EN</name>
							<description>Enable End Point 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0EN</name>
							<description>Enable End Point 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_DMA_DIR</name>
					<displayName>EP_DMA_DIR</displayName>
					<description>DMA End-point direction register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>DAM_DIR4</name>
							<description>Point 4 Dma Dir</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAM_DIR3</name>
							<description>Point 3 Dma Dir</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAM_DIR2</name>
							<description>Point 2 Dma Dir</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAM_DIR1</name>
							<description>Point 1 Dma Dir</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_TYPE</name>
					<displayName>EP_TYPE</displayName>
					<description>Endpoint type register</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EP4_TYPE</name>
							<description>Point 4 type</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3_TYPE</name>
							<description>Point 3 type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2_TYPE</name>
							<description>Point 2 type</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1_TYPE</name>
							<description>Point 1 type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_INDEX1_2</name>
					<displayName>EP_INDEX1_2</displayName>
					<description>End-point index register 1_2</description>
					<addressOffset>0x70</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0021</resetValue>
					<fields>
						<field>
							<name>INDEX2</name>
							<description>Point 2 index</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INDEX1</name>
							<description>Point 1 index</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_INDEX3_4</name>
					<displayName>EP_INDEX3_4</displayName>
					<description>End-point index register 3_4</description>
					<addressOffset>0x74</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0043</resetValue>
					<fields>
						<field>
							<name>INDEX4</name>
							<description>Point 4 index</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INDEX3</name>
							<description>Point 3 index</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TOG_CTRL1_4</name>
					<displayName>TOG_CTRL1_4</displayName>
					<description>TOG CTRL1_4 register</description>
					<addressOffset>0x78</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DTOG4EN</name>
							<description>Set End Point 4 enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG4</name>
							<description>Set End Point 4 Toggle</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG3EN</name>
							<description>Set End Point 3 enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG3</name>
							<description>Set End Point 3 Toggle</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG2EN</name>
							<description>Set End Point 2 enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG2</name>
							<description>Set End Point 2 Toggle</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG1EN</name>
							<description>Set End Point 1 enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTOG1</name>
							<description>Set End Point 1 Toggle</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TOG_STAT1_4</name>
					<displayName>TOG_STAT1_4</displayName>
					<description>TOG STAT1_4 register</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OUT_TOG4</name>
							<description>End Point 4 Toggle ON State</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_TOG4</name>
							<description>End Point 4 Toggle IN State</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_TOG3</name>
							<description>End Point 3 Toggle ON State</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_TOG3</name>
							<description>End Point 3 Toggle IN State</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_TOG2</name>
							<description>End Point 2 Toggle ON State</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_TOG2</name>
							<description>End Point 2 Toggle IN State</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_TOG1</name>
							<description>End Point 1 Toggle ON State</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IN_TOG1</name>
							<description>End Point 1 Toggle IN State</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP0</name>
					<displayName>SETUP0</displayName>
					<description>Setup Date 0 register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD0</name>
							<description>Setup Data 0</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP1</name>
					<displayName>SETUP1</displayName>
					<description>Setup Date 1 register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD1</name>
							<description>Setup Data 1</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP2</name>
					<displayName>SETUP2</displayName>
					<description>Setup Date 2 register</description>
					<addressOffset>0x88</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD2</name>
							<description>Setup Data 2</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP3</name>
					<displayName>SETUP3</displayName>
					<description>Setup Date 3 register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD3</name>
							<description>Setup Data 3</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP4</name>
					<displayName>SETUP4</displayName>
					<description>Setup Date 4 register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD4</name>
							<description>Setup Data 4</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP5</name>
					<displayName>SETUP5</displayName>
					<description>Setup Date 5 register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD5</name>
							<description>Setup Data 5</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP6</name>
					<displayName>SETUP6</displayName>
					<description>Setup Date 6 register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD6</name>
							<description>Setup Data 6</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP7</name>
					<displayName>SETUP7</displayName>
					<description>Setup Date 7 register</description>
					<addressOffset>0x9C</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SETUPD7</name>
							<description>Setup Data 7</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PACKET_SIZEL</name>
					<displayName>PACKET_SIZEL</displayName>
					<description>PACKET SIZEL  register</description>
					<addressOffset>0xa0</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x40</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SIZE0</name>
							<description>USB Max Packet Size</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PACKET_SIZEH</name>
					<displayName>PACKET_SIZEH</displayName>
					<description>PACKET SIZEH register</description>
					<addressOffset>0xa4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0040</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>SIZE1</name>
							<description>USB Max Packet Size</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0_AVAIL</name>
					<displayName>EP0_AVAIL</displayName>
					<description>EP0 AVAIL register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP0AVIL</name>
							<description>EP0 FIFO available data number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP1_AVAIL</name>
					<displayName>EP1_AVAIL</displayName>
					<description>EP1 AVAIL register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP1AVIL</name>
							<description>EP1 FIFO available data number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP2_AVAIL</name>
					<displayName>EP2_AVAIL</displayName>
					<description>EP2 AVAIL register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP2AVIL</name>
							<description>EP2 FIFO available data number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP3_AVAIL</name>
					<displayName>EP3_AVAIL</displayName>
					<description>EP3 AVAIL register</description>
					<addressOffset>0x10c</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP3AVIL</name>
							<description>EP3 FIFO available data number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP4_AVAIL</name>
					<displayName>EP4_AVAIL</displayName>
					<description>EP4 AVAIL register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP4AVIL</name>
							<description>EP4 FIFO available data number</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DAM_ADDR0</name>
					<displayName>DMA_ADDR0</displayName>
					<description>DMA1 ADDR0 register</description>
					<addressOffset>0x120</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA_ADDR0</name>
							<description>USB DAM address0[7:0]</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DAM_ADDR1</name>
					<displayName>DMA_ADDR1</displayName>
					<description>DMA1 ADDR1 register</description>
					<addressOffset>0x124</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA_ADDR1</name>
							<description>USB DAM address1[15:8]</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DAM_ADDR2</name>
					<displayName>DMA_ADDR2</displayName>
					<description>DMA1 ADDR2 register</description>
					<addressOffset>0x128</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA_ADDR2</name>
							<description>USB DAM address2[23:16]</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DAM_ADDR3</name>
					<displayName>DMA_ADDR3</displayName>
					<description>DMA1 ADDR3 register</description>
					<addressOffset>0x12C</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA_ADDR3</name>
							<description>USB DAM address3[31:24]</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_NUML</name>
					<displayName>DMA_NUML</displayName>
					<description>DMA NUML register</description>
					<addressOffset>0x130</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA_NUML</name>
							<description>EP2 DMA number 0-7</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_NUMH</name>
					<displayName>DMA_NUMH</displayName>
					<description>DMA NUMH register</description>
					<addressOffset>0x134</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>DMA1_NUMH</name>
							<description>EP2 DMA number 8-15</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0_CTRL</name>
					<displayName>EP0_CTRL</displayName>
					<description>EP0 CTRL register</description>
					<addressOffset>0x140</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TRANEN</name>
							<description>EP0 transfer enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRANCOUNT</name>
							<description>EP0 transfer counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP1_CTRL</name>
					<displayName>EP1_CTRL</displayName>
					<description>EP1 CTRL register</description>
					<addressOffset>0x144</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TRANEN</name>
							<description>EP1 transfer enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRANCOUNT</name>
							<description>EP1 transfer counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP2_CTRL</name>
					<displayName>EP2_CTRL</displayName>
					<description>EP2 CTRL register</description>
					<addressOffset>0x148</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TRANEN</name>
							<description>EP2 transfer enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRANCOUNT</name>
							<description>EP2 transfer counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP3_CTRL</name>
					<displayName>EP3_CTRL</displayName>
					<description>EP3 CTRL register</description>
					<addressOffset>0x14C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TRANEN</name>
							<description>EP3 transfer enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRANCOUNT</name>
							<description>EP3 transfer counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP4_CTRL</name>
					<displayName>EP4_CTRL</displayName>
					<description>EP4 CTRL register</description>
					<addressOffset>0x150</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TRANEN</name>
							<description>EP4 transfer enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRANCOUNT</name>
							<description>EP4 transfer counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0_FIFO</name>
					<displayName>EP0_FIFO</displayName>
					<description>EP0 FIFO register</description>
					<addressOffset>0x160</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP0_FIFO</name>
							<description>EP0 FIFO port</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP1_FIFO</name>
					<displayName>EP1_FIFO</displayName>
					<description>EP1 FIFO register</description>
					<addressOffset>0x164</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP1_FIFO</name>
							<description>EP1 FIFO port</description>
						</field>
					</fields>
				</register>
