rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
				<register>
					<name>EP2_FIFO</name>
					<displayName>EP2_FIFO</displayName>
					<description>EP2 FIFO register</description>
					<addressOffset>0x168</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP2_FIFO</name>
							<description>EP2 FIFO port</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP3_FIFO</name>
					<displayName>EP3_FIFO</displayName>
					<description>EP3 FIFO register</description>
					<addressOffset>0x16c</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP3_FIFO</name>
							<description>EP3 FIFO port</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP4_FIFO</name>
					<displayName>EP4_FIFO</displayName>
					<description>EP4 FIFO  register</description>
					<addressOffset>0x170</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>EP4_FIFO</name>
							<description>EP4 FIFO port</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_MEM</name>
					<displayName>EP_MEM</displayName>
					<description>EP MEM register</description>
					<addressOffset>0x180</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<name>EP_MEM</name>
							<description>EP memory</description>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_DMA</name>
					<displayName>EP_DMA</displayName>
					<description>EP DMA  register</description>
					<addressOffset>0x184</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DMA4EN</name>
							<description>EP4 DMA enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA3EN</name>
							<description>EP3 DMA enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2EN</name>
							<description>EP2 DMA enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA1EN</name>
							<description>EP1 DMA enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA0EN</name>
							<description>EP0 DMA enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_HALT</name>
					<displayName>EP_HALT</displayName>
					<description>EP HALT register</description>
					<addressOffset>0x188</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>HALT4</name>
							<description>EP4 halt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALT3</name>
							<description>EP3 halt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALT2</name>
							<description>EP2 halt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALT1</name>
							<description>EP1 halt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALT0</name>
							<description>EP0 halt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>POWER</name>
					<displayName>POWER</displayName>
					<description>Power control register</description>
					<addressOffset>0x1c0</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>WKUP</name>
							<description>Enable controller wake up from suspend state</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SUSP</name>
							<description>suspend</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SUSPEN</name>
							<description>BUS suspend enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>USB_AHB_DMA</name>
					<displayName>USB_AHB_DMA</displayName>
					<description>USB AHB DMA  register</description>
					<addressOffset>0x1c4</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CH3_BS</name>
							<description>Channel 3 burst set</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CH2_BS</name>
							<description>Channel 2 burst set</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CH1_BS</name>
							<description>Channel 1 burst set</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CH0_BS</name>
							<description>Channel 0 burst set</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>USB_AHB_RST</name>
					<displayName>USB_AHB_RST</displayName>
					<description>USB AHB RST  register</description>
					<addressOffset>0x1c8</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EP3</name>
							<description>Endpoint 3 reset</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2</name>
							<description>Endpoint 2 reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1</name>
							<description>Endpoint 1 reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0</name>
							<description>Endpoint 0 reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
