rusttick/SplitHoverEsc/mm06/MM32SPIN06x_s.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>WWDG</name>
			<description>Window watchdog</description>
			<groupName>WWDG</groupName>
			<baseAddress>0x40002C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x060</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WWDG_IWDG</name>
				<description>Watchdog interrupt</description>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>WDGA</name>
							<description>Activation bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>T</name>
							<description>7-bit counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configuration register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>EWI</name>
							<description>Early wakeup interrupt</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WDGTB</name>
							<description>Timer base</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>WINDOW</name>
							<description>7-bit window value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>EWIF</name>
							<description>Early wakeup interrupt flag</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
